<a href="https://colab.research.google.com/github/BrianKipngeno/Brian-Kipngeno-week-3-IP.ipynb/blob/main/Brian_Kipngeno_wk_3_IP.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# Let's import the pandas library
#
import pandas as pd
# as well as the Numpy library
import numpy as np

Loading our datasets

In [45]:
#loading datasets
# We create a URL to csv file (alternatively this can be a filepath)
url ='/content/Telcom_dataset.csv'
df1 = pd.read_csv(url,header =0, names = ['Product','Value','Date_Time','Cell_On_Site','Party_A_Number','Party_B_Number','Country_A','Country_B','Cell_ID','Site_ID'])
df1.head()

  Product  Value              Date_Time  ... Country_B     Cell_ID     Site_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [46]:
#loading the second dataset
# We create a URL to csv file (alternatively this can be a filepath)
url = '/content/Telcom_dataset2.csv'
df2 = pd.read_csv(url,header =1, names = ['Product','Value','Date_Time','Cell_On_Site','Party_A_Number','Party_B_Number','Country_A','Country_B','Cell_ID','Site_ID'])
df2.head()

  Product  Value              Date_Time  ... Country_B     Cell_ID     Site_ID
0   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
2   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
3     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO
4     sms      0  2012-05-07 23:05:41.0  ...     19e2e  /MMplBlWjh  /MMplBlWjh

[5 rows x 10 columns]

In [48]:
#loading dataset3


# We create a URL to csv file (alternatively this can be a filepath)
url ='/content/Telcom_dataset3.csv'
df3 = pd.read_csv(url, header =1, names = ['Product','Value','Date_Time','Cell_On_Site','Party_A_Number','Party_B_Number','Country_A','Country_B','Cell_ID','Site_ID'])
df3.head()

  Product  Value              Date_Time  ... Country_B     Cell_ID     Site_ID
0     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
1   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
2     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
3   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA
4   Voice     10  2012-05-08 23:03:59.0  ...     19e2e  +e+xcimwre  +e+xcimwre

[5 rows x 10 columns]

In [40]:
#loading cells geo dataset.
#
# We create a URL to csv file (alternatively this can be a filepath)
url ='/content/cells_geo.csv'
df_cells = pd.read_csv(url,delimiter=';', header =1, names = ['City','Status','Locality','Geographical_Zone','Zone_Name','Longitude','Latitude','Region','Area','Cell_ID','Site_ID'])

df_cells.head()

      City      Status   Locality  ... Area     Cell_ID     Site_ID
1   ADJAME  In Service    ABIDJAN  ...  NaN  1502501d78  0bb492ef17
2   ADJAME  In Service    ABIDJAN  ...  NaN  0c2e182a0c  0bb492ef17
3  ASSINIE  In Service  INTERIEUR  ...  NaN  69bdfc69fd  8a1e6ce31f
4  ASSINIE  In Service  INTERIEUR  ...  NaN  7a1029d2ab  8a1e6ce31f
5  ASSINIE  In Service  INTERIEUR  ...  NaN  0b4f56438f  8a1e6ce31f

[5 rows x 11 columns]

CLEANING CONCEPTS

In [49]:
#FOR CELL GEOGRAPHICAL DATA
#the unique values
print ("Unique Locality ", df_cells.Locality.nunique(), " out of " , df_cells.Locality.count())
print ("Unique Area ", df_cells.Area.nunique(), " out of " , df_cells.Area.count())
print ("Unique Geographical_Zone ", df_cells.Geographical_Zone.nunique(), " out of " , df_cells.Geographical_Zone.count())
print ("Unique Region ", df_cells.Region.nunique(), " out of " , df_cells.Region.count())
print ("Unique Zone_Name ", df_cells.Zone_Name.nunique(), " out of " , df_cells.Zone_Name.count())
print ("Unique cities ", df_cells.City.nunique(), " out of " , df_cells.City.count())
print ("Unique Site_Id ", df_cells.Site_ID.nunique(), " out of " , df_cells.Site_ID.count())
print ("Unique Cell_ID ", df_cells.Cell_ID.nunique(), " out of " , df_cells.Cell_ID.count())

Unique Locality  2  out of  3973
Unique Area  6  out of  3951
Unique Geographical_Zone  15  out of  3973
Unique Region  19  out of  3973
Unique Zone_Name  33  out of  3967
Unique cities  504  out of  3973
Unique Site_Id  1029  out of  3973
Unique Cell_ID  3915  out of  3973

In [50]:
#for the status
list(df_cells.Status.unique())

['In Service', nan]

In [51]:
#checking null values
#Null values
print(df_cells.isnull().sum())

City                  0
Status               67
Locality              0
Geographical_Zone     0
Zone_Name             6
Longitude             0
Latitude              0
Region                0
Area                 22
Cell_ID               0
Site_ID               0
dtype: int64

In [52]:
#Cells Dataframe Information and it's descriptive statistics
print(df_cells.info())
print(df_cells.describe())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3973 entries, 1 to 3973
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   City               3973 non-null   object
 1   Status             3906 non-null   object
 2   Locality           3973 non-null   object
 3   Geographical_Zone  3973 non-null   object
 4   Zone_Name          3967 non-null   object
 5   Longitude          3973 non-null   float64
 6   Latitude           3973 non-null   float64
 7   Region             3973 non-null   object
 8   Area               3951 non-null   object
 9   Cell_ID            3973 non-null   object
 10  Site_ID            3973 non-null   object
dtypes: float64(2), object(9)
memory usage: 372.5+ KB
None
         Longitude     Latitude
count  3973.000000  3973.000000
mean     -4.877880     6.244970
std       1.300861     1.304289
min      -8.503889     0.000000
25%      -5.846139     5.338639
50%      -4.084500     5.475000
75%      -3.993444     6.872306
max      -0.000000    10.481861

THE CDR DATA

In [59]:
#statistics for telcom_dataset1

print("Information")
print(df1.info())

Information
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Product         5001 non-null   object
 1   Value           5001 non-null   int64
 2   Date_Time       5001 non-null   object
 3   Cell_On_Site    5001 non-null   object
 4   Party_A_Number  5001 non-null   object
 5   Party_B_Number  5001 non-null   object
 6   Country_A       5001 non-null   object
 7   Country_B       5001 non-null   object
 8   Cell_ID         5001 non-null   object
 9   Site_ID         4285 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB
None

In [61]:
#descriptive statistics
print("Descriptive Statistics")
print(df1.describe())

Descriptive Statistics
             Value
count  5001.000000
mean     25.869626
std     101.934502
min       0.000000
25%       0.000000
50%       0.000000
75%      25.000000
max    4440.000000

In [60]:
#for null values
print("Null Values in Cells Dataset")
print(df1.isnull().sum())

Null Values in Cells Dataset
Product             0
Value               0
Date_Time           0
Cell_On_Site        0
Party_A_Number      0
Party_B_Number      0
Country_A           0
Country_B           0
Cell_ID             0
Site_ID           716
dtype: int64

In [63]:
#Telecom_dataset 2  Dataframe Information and it's descriptive statistics
print(" Telecom_dataset 2 Geographic Information")
print(df2.info())
print("Telecom_dataset 2  Descriptive Statistics")
print(df2.describe())
print("Null Values inTelecom_dataset 2 ")
print(df2.isnull().sum())

 Telecom_dataset 2 Geographic Information
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Product         5000 non-null   object
 1   Value           5000 non-null   int64
 2   Date_Time       5000 non-null   object
 3   Cell_On_Site    5000 non-null   object
 4   Party_A_Number  5000 non-null   object
 5   Party_B_Number  5000 non-null   object
 6   Country_A       5000 non-null   object
 7   Country_B       5000 non-null   object
 8   Cell_ID         5000 non-null   object
 9   Site_ID         4324 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB
None
Telecom_dataset 2  Descriptive Statistics
             Value
count  5000.000000
mean     24.339800
std      97.480726
min       0.000000
25%       0.000000
50%       0.000000
75%      25.000000
max    3380.000000
Null Values inTelecom_dataset 2
Product             0
Value               0
Date_Time           0
Cell_On_Site        0
Party_A_Number      0
Party_B_Number      0
Country_A           0
Country_B           0
Cell_ID             0
Site_ID           676
dtype: int64

In [64]:
#Telecom_dataset 3  Dataframe Information and it's descriptive statistics
print(" Telecom_dataset 3 Geographic Information")
print(df3.info())
print("Telecom_dataset 3  Descriptive Statistics")
print(df3.describe())
print("Null Values inTelecom_dataset 3 ")
print(df3.isnull().sum())

 Telecom_dataset 3 Geographic Information
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Product         5000 non-null   object
 1   Value           5000 non-null   int64
 2   Date_Time       5000 non-null   object
 3   Cell_On_Site    5000 non-null   object
 4   Party_A_Number  5000 non-null   object
 5   Party_B_Number  5000 non-null   object
 6   Country_A       5000 non-null   object
 7   Country_B       5000 non-null   object
 8   Cell_ID         5000 non-null   object
 9   Site_ID         4395 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB
None
Telecom_dataset 3  Descriptive Statistics
              Value
count   5000.000000
mean      26.434600
std      224.222108
min        0.000000
25%        0.000000
50%        0.000000
75%       25.000000
max    12900.000000
Null Values inTelecom_dataset 3
Product             0
Value               0
Date_Time           0
Cell_On_Site        0
Party_A_Number      0
Party_B_Number      0
Country_A           0
Country_B           0
Cell_ID             0
Site_ID           605
dtype: int64

In [65]:
#Unique values
#telecom dataset1 
print("telecom dataset1")
print ("Unique Country_A ", df1.Country_A.nunique(), " out of " , df1.Country_A.count())
print ("Unique Country_B ", df1.Country_B.nunique(), " out of " , df1.Country_B.count())
print ("Unique Product ",   df1.Product.nunique(),   " out of " , df1.Product.count())
print ("Unique Cell_On_Site ", df1.Cell_On_Site.nunique(), " out of " , df1.Cell_On_Site.count())
print ("Unique Site_ID ", df1.Site_ID.nunique(), " out of " , df1.Site_ID.count())
print ("Unique Cell_ID ", df1.Cell_ID.nunique(), " out of " , df1.Cell_ID.count())
print ("Unique Party_A_Number ", df1.Party_A_Number.nunique(), " out of " , df1.Party_A_Number.count())
print ("Unique Party_B_Number ", df1.Party_B_Number.nunique(), " out of " , df1.Party_B_Number.count())
#telcom dataset2
print("telcom dataset2")
print ("Unique Country_A ", df2.Country_A.nunique(), " out of " , df2.Country_A.count())
print ("Unique Country_B ", df2.Country_B.nunique(), " out of " , df2.Country_B.count())
print ("Unique Product ",   df2.Product.nunique(),   " out of " , df2.Product.count())
print ("Unique Cell_On_Site ", df2.Cell_On_Site.nunique(), " out of " , df2.Cell_On_Site.count())
print ("Unique Site_ID ", df2.Site_ID.nunique(), " out of " , df2.Site_ID.count())
print ("Unique Cell_ID ", df2.Cell_ID.nunique(), " out of " , df2.Cell_ID.count())
print ("Unique Party_A_Number ", df2.Party_A_Number.nunique(), " out of " , df2.Party_A_Number.count())
print ("Unique Party_B_Number ", df2.Party_B_Number.nunique(), " out of " , df2.Party_B_Number.count())
#telcom Dataset 3
print("telcom Dataset 3")
print ("Unique Country_A ", df3.Country_A.nunique(), " out of " , df3.Country_A.count())
print ("Unique Country_B ", df3.Country_B.nunique(), " out of " , df3.Country_B.count())
print ("Unique Product ",   df3.Product.nunique(),   " out of " , df3.Product.count())
print ("Unique Cell_On_Site ", df3.Cell_On_Site.nunique(), " out of " , df3.Cell_On_Site.count())
print ("Unique Site_ID ", df3.Site_ID.nunique(), " out of " , df3.Site_ID.count())
print ("Unique Cell_ID ", df3.Cell_ID.nunique(), " out of " , df3.Cell_ID.count())
print ("Unique Party_A_Number ", df3.Party_A_Number.nunique(), " out of " , df3.Party_A_Number.count())
print ("Unique Party_B_Number ", df3.Party_B_Number.nunique(), " out of " , df3.Party_B_Number.count())

telecom dataset1
Unique Country_A  1  out of  5001
Unique Country_B  2  out of  5001
Unique Product  3  out of  5001
Unique Cell_On_Site  7  out of  5001
Unique Site_ID  1076  out of  4285
Unique Cell_ID  1790  out of  5001
Unique Party_A_Number  3903  out of  5001
Unique Party_B_Number  2848  out of  5001
telcom dataset2
Unique Country_A  1  out of  5000
Unique Country_B  2  out of  5000
Unique Product  3  out of  5000
Unique Cell_On_Site  8  out of  5000
Unique Site_ID  1027  out of  4324
Unique Cell_ID  1661  out of  5000
Unique Party_A_Number  3799  out of  5000
Unique Party_B_Number  2882  out of  5000
telcom Dataset 3
Unique Country_A  1  out of  5000
Unique Country_B  2  out of  5000
Unique Product  3  out of  5000
Unique Cell_On_Site  9  out of  5000
Unique Site_ID  961  out of  4395
Unique Cell_ID  1596  out of  5000
Unique Party_A_Number  3593  out of  5000
Unique Party_B_Number  2895  out of  5000

In [66]:
#Check duplicates
print(df1[df1.duplicated(keep=False)])

     Product  Value              Date_Time  ... Country_B     Cell_ID     Site_ID
765      sms      0  2012-05-07 00:00:03.0  ...     19e2e  23c5372bd3  e942f32a29
769      sms     25  2012-05-07 00:00:03.0  ...     19e2e  a6606f4ac1  c6400e443f
793      sms      0  2012-05-07 00:00:03.0  ...     19e2e  23c5372bd3  e942f32a29
794      sms     25  2012-05-07 00:00:03.0  ...     19e2e  a6606f4ac1  c6400e443f
795    Voice      0  2012-05-07 00:00:04.0  ...     19e2e  4a7047f1ba  dea1e52d3b
...      ...    ...                    ...  ...       ...         ...         ...
4864   Voice   1610  2012-05-07 00:01:50.0  ...     19e2e  89b82605a0  5324bc6c24
4932   Voice      0  2012-05-07 00:01:52.0  ...     19e2e  d6abb7e15f  f72cd95f00
4943   Voice      0  2012-05-07 00:01:52.0  ...     19e2e  d6abb7e15f  f72cd95f00
4944   Voice     60  2012-05-07 00:01:53.0  ...     19e2e  fd754bd0d0  e82c07d996
4970   Voice     60  2012-05-07 00:01:53.0  ...     19e2e  fd754bd0d0  e82c07d996

[164 rows x 10 columns]

In [67]:
#Combining the telcom datasets
df_cdr = pd.concat([df1,df2,df3], axis=0)
df_cdr.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 15001 entries, 0 to 4999
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Product         15001 non-null  object
 1   Value           15001 non-null  int64
 2   Date_Time       15001 non-null  object
 3   Cell_On_Site    15001 non-null  object
 4   Party_A_Number  15001 non-null  object
 5   Party_B_Number  15001 non-null  object
 6   Country_A       15001 non-null  object
 7   Country_B       15001 non-null  object
 8   Cell_ID         15001 non-null  object
 9   Site_ID         13004 non-null  object
dtypes: int64(1), object(9)
memory usage: 1.3+ MB

In [71]:
#to Change data types of date columns which are storing date values to date for ease of calculation
df_cdr['Date_Time'] = pd.to_datetime(df_cdr['Date_Time'])

In [74]:
#Drop duplicates
df_cdr = df_cdr.drop_duplicates()
df_cdr.info

<bound method DataFrame.info of      Product  Value           Date_Time  ... Country_B     Cell_ID     Site_ID
0      Voice      0 2012-05-06 23:04:37  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1        sms      0 2012-05-06 23:05:25  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2        sms     25 2012-05-06 23:05:41  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3      Voice     56 2012-05-06 23:05:42  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4      Voice     14 2012-05-06 23:06:29  ...     19e2e  051KhYDCpv  051KhYDCpv
...      ...    ...                 ...  ...       ...         ...         ...
4994   Voice     10 2012-05-09 00:01:43  ...     OTHER  6467daa1db  8a96bae9c1
4995   Voice      0 2012-05-09 00:01:43  ...     19e2e  2aa04dcab7  f7d63a29e5
4996   Voice     62 2012-05-09 00:01:43  ...     19e2e  7f1f2f889f  b4ddb9e93c
4998   Voice     30 2012-05-09 00:01:43  ...     19e2e  98ed726da2  b4130b54ab
4999   Voice     60 2012-05-09 00:01:43  ...     19e2e  1c11a2fcbb  6d70dae094

[14748 rows x 10 columns]>

In [75]:
#Merging telcom and cell dataset
df_cdr_cells = pd.merge(df_cdr,df_cells, how='inner', on=['Cell_ID'])

In [76]:
# df_cells.loc[df_cells['Cell_ID'] =="/TJNe+Mmtu"]
df_cdr_cells.info()

<class 'pandas.core.frame.DataFrame'>
Index: 0 entries
Data columns (total 20 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Product            0 non-null      object
 1   Value              0 non-null      int64
 2   Date_Time          0 non-null      datetime64[ns]
 3   Cell_On_Site       0 non-null      object
 4   Party_A_Number     0 non-null      object
 5   Party_B_Number     0 non-null      object
 6   Country_A          0 non-null      object
 7   Country_B          0 non-null      object
 8   Cell_ID            0 non-null      object
 9   Site_ID_x          0 non-null      object
 10  City               0 non-null      object
 11  Status             0 non-null      object
 12  Locality           0 non-null      object
 13  Geographical_Zone  0 non-null      object
 14  Zone_Name          0 non-null      object
 15  Longitude          0 non-null      float64
 16  Latitude           0 non-null      float64
 17  Region             0 non-null      object
 18  Area               0 non-null      object
 19  Site_ID_y          0 non-null      object
dtypes: datetime64[ns](1), float64(2), int64(1), object(16)
memory usage: 0.0+ bytes

In [77]:
#most used city for the three days
df_cdr.groupby('Cell_ID').count().nlargest(5,'Product')

            Product  Value  Date_Time  ...  Country_A  Country_B  Site_ID
Cell_ID                                ...
ffa6759bb2     1960   1960       1960  ...       1960       1960        0
03ee801971       73     73         73  ...         73         73       73
cc7ce19d6b       65     65         65  ...         65         65       65
b78724d6fc       42     42         42  ...         42         42       42
d22224b2fa       40     40         40  ...         40         40       40

[5 rows x 9 columns]

In [78]:
#most used during business and home hours
df_cdr.groupby('Product')['Value'].sum()

Product
Voice    306655
data      17285
sms       52377
Name: Value, dtype: int64

In [79]:
#Busiest time of the day
df_cdr.groupby('Site_ID')['Value'].sum()

Site_ID
++ctND+jGD    134
+38u2u/rfx    186
+854AcBQT2    154
+Fs4mTvdKx     31
+QZ9qRtNxA     55
             ...
feffc8c92b    297
ff1b78ec81    322
ffa6bdc032    499
ffc9f56819    177
fff5ac6e3f     28
Name: Value, Length: 1357, dtype: int64